app/controllers/questionnaires_controller.rb

  def respond
  begin
   responses = params[:responses].first

   user = User.new

   tosave = []

   unless responses.nil?
     responses.each do |r|
       choices = r.last

       choices.each do |c|
         response = Response.new
         response.question_id = r.first
---
SELECT * FROM "questions" ORDER BY question_order

     end
   end

   user.save!
---
INSERT INTO "users" ("location", "created_at", "updated_at", "age") VALUES('Rock Valley, IA', '2009-12-06 03:50:04', '2009-12-06 03:50:04', '21')

  def addchoice

    choice = Choice.new
    choice.text = params[:newchoice]
    choice.question_id = params[:question_id]
    choice.save

    q = Question.find(choice.question_id)
---
INSERT INTO "choices" ("updated_at", "text", "question_id", "choice_index", "created_at") VALUES('2009-08-13 19:33:49', 'we7', 3, NULL, '2009-08-13 19:33:49')
SELECT * FROM "choices" WHERE ("choices".question_id = 3) ORDER BY choice_index, text
SELECT * FROM "questions" WHERE ("questions"."id" = 17)